{
  "_class_name": "PI0Policy",
  "_diffusers_version": "0.36.0",
  "max_action_dim": 32,
  "max_state_dim": 32,
  "n_action_steps": 50,
  "num_steps": 10,
  "pi05_enabled": true,
  "proj_width": 1024,
  "use_cache": true,
  "model_type": "pi0_torch",
  "architectures": [
    "PI0ForActionPrediction"
  ],
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "state_norm_stats": {
    "mean": [
      0.5759623646736145,
      0.02986043505370617,
      0.16405485570430756,
      2.914252519607544,
      -0.22664900124073029,
      -0.1459236741065979,
      0.026359455659985542,
      -0.025808148086071014,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "std": [
      0.10304990410804749,
      0.15156953036785126,
      0.09018027782440186,
      0.5415107011795044,
      0.9878426194190979,
      0.3436369001865387,
      0.014926648698747158,
      0.01544011291116476,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0
    ],
    "q01": [
      0.32401121418476103,
      -0.27383318091630937,
      0.0015248513882979743,
      1.3758248781204223,
      -2.7998716789245606,
      -1.1413422079086304,
      0.003031999932229519,
      -0.03999999910593033,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0
    ],
    "q99": [
      0.771252784961462,
      0.3400156024813652,
      0.34734600509889424,
      3.265397991895675,
      2.4128234372138975,
      0.5941102310180661,
      0.03999199910610914,
      -0.00011401521340012599,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0
    ]
  },
  "action_norm_stats": {
    "mean": [
      0.005396964494138956,
      0.005696895997971296,
      -0.004527020268142223,
      -0.008367733098566532,
      -0.004687069915235043,
      -0.0025497355964034796,
      0.06252926588058472,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0,
      0.0
    ],
    "std": [
      0.02177368849515915,
      0.028654400259256363,
      0.03035234473645687,
      0.2756039500236511,
      0.11179430782794952,
      0.06889988481998444,
      0.9980431199073792,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0
    ],
    "q01": [
      -0.04430467200875282,
      -0.07126717302501201,
      -0.08745860934257507,
      -0.20018449087142898,
      -0.27037766637802196,
      -0.193730121088028,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0,
      -1.0
    ],
    "q99": [
      0.0820973156929016,
      0.0948017251715064,
      0.08566059339046478,
      0.10745925769805886,
      0.2971878942489621,
      0.17199196071624767,
      0.9996,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0
    ]
  }
}
